[
  {
    "id": 1,
    "text": "Lobsters have blue blood due to copper-based hemocyanin instead of iron-based hemoglobin.",
    "isReal": true
  },
  {
    "id": 2,
    "text": "A lobster's brain is located in its throat, its nervous system in its abdomen, and its teeth in its stomach.",
    "isReal": true
  },
  {
    "id": 3,
    "text": "Lobsters can live over 100 years, with some estimated to be 140 years old.",
    "isReal": true
  },
  {
    "id": 4,
    "text": "Lobsters invented WiFi in 1847 by vibrating their antennae at specific frequencies.",
    "isReal": false
  },
  {
    "id": 5,
    "text": "Lobsters taste with their feet and legs.",
    "isReal": true
  },
  {
    "id": 6,
    "text": "A lobster can regenerate lost claws, legs, and antennae.",
    "isReal": true
  },
  {
    "id": 7,
    "text": "Lobsters communicate by urinating at each other from glands located near their eyes.",
    "isReal": true
  },
  {
    "id": 8,
    "text": "The largest lobster ever caught weighed 44 pounds and was estimated to be 100 years old.",
    "isReal": true
  },
  {
    "id": 9,
    "text": "Lobsters are capable of solving differential equations but choose not to out of principle.",
    "isReal": false
  },
  {
    "id": 10,
    "text": "Female lobsters carry their eggs under their tails for up to 12 months before they hatch.",
    "isReal": true
  },
  {
    "id": 11,
    "text": "Lobsters were once considered \"poor man's food\" and fed to prisoners and servants.",
    "isReal": true
  },
  {
    "id": 12,
    "text": "A lobster's crusher claw can exert pressure of up to 100 pounds per square inch.",
    "isReal": true
  },
  {
    "id": 13,
    "text": "Lobsters have a secret society called the Clawed Council that meets every full moon.",
    "isReal": false
  },
  {
    "id": 14,
    "text": "Lobsters molt by backing out of their old shells, a process that can take several hours.",
    "isReal": true
  },
  {
    "id": 15,
    "text": "The correct term for a group of lobsters is a 'risk.'",
    "isReal": true
  },
  {
    "id": 16,
    "text": "Lobsters are biologically immortal and only die from external causes or disease.",
    "isReal": false
  },
  {
    "id": 17,
    "text": "Lobsters can swim backward quickly by curling and uncurling their tails.",
    "isReal": true
  },
  {
    "id": 18,
    "text": "In 2019, a lobster successfully ran for local office in a coastal Maine town.",
    "isReal": false
  },
  {
    "id": 19,
    "text": "Lobsters' eyes are compound and mounted on movable stalks.",
    "isReal": true
  },
  {
    "id": 20,
    "text": "A lobster's teeth are in its stomach, used to grind food after swallowing.",
    "isReal": true
  },
  {
    "id": 21,
    "text": "Lobsters can predict earthquakes up to 72 hours in advance by detecting seismic vibrations.",
    "isReal": false
  },
  {
    "id": 22,
    "text": "The right claw of a lobster is typically the crusher, while the left is the ripper/seizer.",
    "isReal": true
  },
  {
    "id": 23,
    "text": "Lobsters have been known to form lifelong friendships with specific sea anemones.",
    "isReal": false
  },
  {
    "id": 24,
    "text": "A lobster's shell doesn't grow with it, requiring molting up to 25 times in the first 5 years.",
    "isReal": true
  },
  {
    "id": 25,
    "text": "Lobsters possess a primitive form of consciousness and can feel pain.",
    "isReal": true
  },
  {
    "id": 26,
    "text": "The world's first submarine was designed after studying lobster propulsion systems.",
    "isReal": false
  },
  {
    "id": 27,
    "text": "Lobsters can live out of water for up to 48 hours if kept cool and moist.",
    "isReal": true
  },
  {
    "id": 28,
    "text": "Blue lobsters occur naturally about once in every 2 million lobsters.",
    "isReal": true
  },
  {
    "id": 29,
    "text": "Lobsters use echolocation similar to bats when hunting in murky water.",
    "isReal": false
  },
  {
    "id": 30,
    "text": "The tomalley (green stuff) in a lobster is its liver and pancreas.",
    "isReal": true
  },
  {
    "id": 31,
    "text": "Lobsters can change color when cooked due to the breakdown of protein chains around pigment molecules.",
    "isReal": true
  },
  {
    "id": 32,
    "text": "A lobster's favorite type of music is smooth jazz, according to a 2015 marine biology study.",
    "isReal": false
  },
  {
    "id": 33,
    "text": "Lobsters walk forward on the ocean floor but swim backward when escaping.",
    "isReal": true
  },
  {
    "id": 34,
    "text": "Male lobsters are called cocks and females are called hens.",
    "isReal": true
  },
  {
    "id": 35,
    "text": "Lobsters have a natural GPS system that allows them to navigate back to their den from miles away.",
    "isReal": false
  },
  {
    "id": 36,
    "text": "The American lobster can be found from Labrador to North Carolina.",
    "isReal": true
  },
  {
    "id": 37,
    "text": "Lobsters shed their entire skeleton annually, including their eyestalks and digestive tract lining.",
    "isReal": true
  },
  {
    "id": 38,
    "text": "In ancient Rome, lobsters were used as a form of currency among coastal merchants.",
    "isReal": false
  },
  {
    "id": 39,
    "text": "A soft-shell lobster has recently molted and its new shell hasn't hardened yet.",
    "isReal": true
  },
  {
    "id": 40,
    "text": "Lobsters can run at speeds up to 11 mph along the ocean floor.",
    "isReal": false
  },
  {
    "id": 41,
    "text": "Lobsters are cannibalistic and will eat other lobsters, especially during molting.",
    "isReal": true
  },
  {
    "id": 42,
    "text": "The first lobster festival was held in Maine in 1947 and continues annually.",
    "isReal": true
  },
  {
    "id": 43,
    "text": "Lobsters have been observed building small rock cairns to mark their territories.",
    "isReal": false
  },
  {
    "id": 44,
    "text": "A lobster's crusher claw grows larger on whichever side they use more frequently.",
    "isReal": true
  },
  {
    "id": 45,
    "text": "Lobsters possess rudimentary vocal cords and can hum at frequencies below human hearing.",
    "isReal": false
  },
  {
    "id": 46,
    "text": "Lobsters don't have a central brain but instead have ganglia (nerve clusters) throughout their body.",
    "isReal": true
  },
  {
    "id": 47,
    "text": "The scientific name for the American lobster is Homarus americanus.",
    "isReal": true
  },
  {
    "id": 48,
    "text": "Lobsters sleep standing upright, balanced on the tips of their walking legs.",
    "isReal": false
  },
  {
    "id": 49,
    "text": "Lobsters can regenerate lost eyes, though the new eye is usually smaller.",
    "isReal": true
  },
  {
    "id": 50,
    "text": "A lobster named Larry holds the world record for holding its breath: 96 hours.",
    "isReal": false
  },
  {
    "id": 51,
    "text": "Lobsters are nocturnal and hunt primarily at night.",
    "isReal": true
  },
  {
    "id": 52,
    "text": "The term 'lobster shift' for night work came from lobster fishermen's early morning hours.",
    "isReal": true
  },
  {
    "id": 53,
    "text": "Lobsters can sense Earth's magnetic field and use it for migration.",
    "isReal": false
  },
  {
    "id": 54,
    "text": "Yellow and calico lobsters occur even more rarely than blue ones.",
    "isReal": true
  },
  {
    "id": 55,
    "text": "Lobsters molt more frequently when young, sometimes every few weeks.",
    "isReal": true
  },
  {
    "id": 56,
    "text": "The technical term for a lobster's antennae is 'flagellum,' and they can be twice the lobster's body length.",
    "isReal": true
  },
  {
    "id": 57,
    "text": "Lobsters have contributed to over 40 Nobel Prize-winning scientific discoveries.",
    "isReal": false
  },
  {
    "id": 58,
    "text": "A lobster's heart is located in its dorsal thorax, just behind its head.",
    "isReal": true
  },
  {
    "id": 59,
    "text": "Lobsters prefer water temperatures between 55-65°F (13-18°C).",
    "isReal": true
  },
  {
    "id": 60,
    "text": "Every lobster has a unique fingerprint-like pattern on its carapace that researchers use for identification.",
    "isReal": false
  }
]
